[
    {
        "input": "اكتب أبياتًا بعد هذا البيت: أَصبَحَ المُلك لِلَّذي فَطر الخَل قَ بِتَقديرٍ للعَزيز العَليمِ",
        "output": "غافر الذَنب للمسيءِ بِعَفوٍ قابل التَوب ذي العَطاء العَميمِ\nمُرسل المُصطَفى البَشير إِلَينا رَحمة مِنهُ بِالكَلام القَديمِ\nرَبَنا رَبّنا إِلَيكَ أَنينا فَأَجرنا مِن حَر نار الجَحيمِ\nوَاكفِنا شَرّ ما نَخاف بِلُطفٍ يا عَظيماً يَرجى لِكُل عَظيمِ\nوَتَقبل أَعمالَنا وَاعفُ عَنا وَأَنلنا دُخول دار النَعيمِ\nبِنَبي بَعثَتهُ فَهَدانا لِصِراط مِن الهُدى مُستَقيمِ\nوَبِمَن نَحنُ في حِماهُ مَدى الدَهر أَخيهِ يَحيى الحصور الكَريمِ\nأَدرك أَدرك قَوماً أَتوا بافتقار وَاِنكِسار وَمَدمَع مَسجومِ\nشَهدت أَرواحَهُم أَنكَ اللَهُ وَجاءوا بِكُل قَلبٍ سَليم"
    },
    {
        "input": "اكتب أبياتًا بعد هذا البيت: مِن أَي مَولى اِرتَجي وَلاي باب التَجي",
        "output": "وَاللَهُ حَيٌّ رازِقٌ يُعطي الجَزيل لمُرتَجي\nرَب جَواد لَم يَزَل مِن كُل ضيقٍ مَخرَجي\nإِن رُحت أَرجوغَيرَهُ خابَ الرواح مَع المَجي\nيا عَيس آمالي أَقصدي باب الكَريم وَعَرجي\nوَضَعي رِحالك وَاِرتَعي فَالأُم حَمل المُزعجِ\nوَتَوسَلي بِمُحمدٍ وَبِآلهِ كَي تَنتجي\nالهاشمي المُصطَفى صج الهُدى المُتَبَلِجِ\nوَبِشَيبة الصَديق صا حب كل فَضل أَبهَجِ\nوَالسَيد الفاروق مِن بِسِوى الهُدى لَم يَلهجِ\nوَبصنوه عُثمان ذي الن نورَين أَقوم مَنهَجِ\nوَعَليٍّ الكرّار فا تح كُل باب مُرتجِ\nوَبَقية الصَحب الكِرا م أَولي الثَنا المُتَأرجِ\nهُم أَبحر الفَضل الَّذي نَ بِغَيرِهُم لَم تُفرجِ\nوَكَذا السَفينة إِن نَجَت فَجَميع مَن فيها نَجي"
    },
    {
        "input": "اكتب أبياتًا بعد هذا البيت: العَبد عَبدك يا مَن أَنتَ سَيدهُ وَلَيسَ غَيركَ في الأَوصابِ يُنجدهُ",
        "output": "أَنتَ الَّذي لِسَبيل الخَير تُرشِدُهُ مالي سَواكَ رَسول اللَهِ أَقصِدُهُ\nوَمِن جَنابِكَ في الدارين مُلتَمسي لا أَستَعين بِأَنصار وَلا عَدَد\nوَلا بِجاه وَلا مال وَلا وَلَد بَل أَنتَ أَنتَ الرَجا يا خَير مُعتَمَدِ\nلَولاكِ ما خُلِقَت روحي وَلا جَسَدي وَلا حَياتي وَلا نَفسي وَلا نَفسي\nأَنت الَّذي حازَ رايات العُلى وَعَلى مَتن البُراق إِلى السَبع الطِباق عَلا\nما خابَ قاصدك الراجي وَلا خَجَلا حَططتُ رحل رَجائي في ذُراك فَلا\nتَجعَل رَجائي بِمَردود وَمُنعَكِسِ أَشكو إِلَيكَ تَباريحاً وَفَرط أَسى\nمِن اعتِلال ذُنوب حارَ فيهِ أَسا أَدرك بِلُطفك أَن الصَبر قَد دَرَسا\nوَأَمطر عَلَيَّ سجالاً مِن نَداكَ عَسى يَخضر مِن رَوض حَظي جانب اليَبسِ\nآل النَبي خَذوا لي عِندَ جَدِكُم مَكانة أَحتَمي فيها بِجَدِكُم\nقَد لَذَ لي الشُكر في أَوصاف مَجدِكُم أَوَد عِندَ إِدكاري خَير حَمدَكُم\nعَن ذَلِكَ النُطق لَو عَوضت بِالخَرس"
    },
    {
        "input": "اكتب أبياتًا بعد هذا البيت: لَو كُنتَ أَطمَع بِالمَنام تَوهما لَسالَت طَيفكَ أَن يَزور تَكَرما",
        "output": "حاشا صُدودك أَن تَذم فَإِنَّها تَحلو لَدَيَّ وَإِن أُسيغَت عَلقَما\nفَاِهجُر فَهَجرك لي التِفات مَودة أَلقاهُ مِنكَ تَحنناً وَتَرَحُما\nعَذب فُوادي بِالَّذي تَختارَهُ لَو كُنتُ مَنسيّاً تَرَكتُ وَإِنَّما\nلَو لَم تَكُن بِغُبار طَرفِكَ كَحلت عَين الغَزالة صَدّها وَجه الدُما\nعَيدي لِفَقدِكَ مَأَتم لَو صافَحت فيهِ المَسَرة خاطِري لَتَأَلَما\nهاتَ إِسقِني كَأس المَلامة عاذِلي وَأدر عَليَّ حَديثُهُ مُتَرَنِما\nفَإِذا ذَكرت ليَ الحَبيب يَكادُ مِن طَربي يَقبل مَسمَعي مِنكَ الفَما\nإِني لَأَعشَقُ في هَواهُ عَواذِلي شَغَفاً بِهِ وَأَود فيهِ اللُوَّما\nسَرق الرَسول بَلَحظِهِ مِن وَجهِهِ حُسناً أَبى عَن ناظِري أَن يَكتما\nدَعني أُسامر هَجرَهُ في خُلوة فَكَفى لِمِثلي أَن يَراني مَحرَما\nبَدرٌ مِن الأَتراك لَما أَن بَدا تَرك البُدور تَرى لِعَينِكَ أَنجُما\nتَسقي لَواحِظُهُ العُقول مُدامة الصَحو مِنها لا يَزالُ محرّما\nلَو بِتُ أَشكو ظُلمُهُ لَشَكَوتُهُ لِمَليك هَذا الدَهر أَسما مَن سَما\nمَلك مِن الإِيمان جَرد صارِماً بِالحَق حَتّى الكُفر أَصبَحَ مُسلِما\nقَد جَهَز السُفن الَّتي صادَمَت رَضوى بِأَيسر لَمحة لِتهدَّما\nوَتُلهب البَحر الخِضَم مَهابَةً مِنهُ فَظَنَتهُ كَريتُ جَهَنَما\nلَو شاهَدَ المَطرود سَطوةَ باسِهِ في صُلبِ آدم لِلسُجود تَقَدَما\nالعَدل أَخرسَ كانَ قَبل زَمانِهِ أَذنت لَهُ الأَيام أَن يَتَكَلَّما\nيَذَر الدُجى بِالبَشر صُبحاً مُشرِقاً وَالصُبح بِالإِرهاب لَيلاً مُظلِما\nلَم تَخط آساد الفَلافي عَهدِهِ بَينَ الشَقائِقِ خيفة أَن تَتَهما\nعقد النثار عَلى العِداة سَحائِباً لَولا الحَيا لَسقى السَما مِنها دَما\nوَدَعَت ظُباهُ الطَيرَ حَتّى أَنَّهُ قَد يَكادُ يَسقُط فَرحة نسر السَما\nلَو يَرتَضي حَمل السِهام لَغارة لَرَأَيتُهُ اِتَخَذَ الكَواكب أَسهُما\nأَو شاءَ أَن يَهب المُلوك لِبَعض ما في رِقِهِ مُستَحقراً لَتَبَرما\nصِحت مِن السقم العُقول بِحِلمِهِ وَبِظِلِهِ الدين القَويم قَد اِحتَمى\nتَب يا زَمان فَإِن ذكرتك عِندَهُ مِن قَبل أَن يَنهاكَ مُتَّ تَوَهُّما"
    },
    {
        "input": "اكتب أبياتًا بعد هذا البيت: يعد عَليَّ أَنفاسي ذُنوباً إِذا ما قُلت أَفديهِ حَبيبا",
        "output": "وَأَبعد ما يَكون الود مِنهُ إِذا ما باتَ مِن أَمَلي قَريبا\nحَبيب كُلَّما يَلقاهُ صَبٌّ يَصير عَلَيهِ مَن يَهوى رَقيبا\nيَعاف مَنازل العُشاق كَبراً وَلَو فَرشت مَسالكها قُلوبا\nفَلو حَمل النَسيم إِلَيهِ مِني سَلاماً راحَ يَمنَعَهُ هُبوبا\nأَغار عَلى الجَفا مِنهُ لِغَيري فَلَيتَ جَفاهُ أَضحى لي نَصيبا\nوَأَعشَق أَعيُن الرقباءَ فيهِ وَلَو مَلَئت عُيونَهُم عُيوبا\nلَقَد أَخَذَ الهَوى بِزِمام قَلبي وَصَير دَمع أَجفاني صَبيبا\nوَما أَملت في أَهلي نَصيراً فَكَيفَ الآن أَطلبهُ غَريبا\nوَأَقصِد أَن يَعيد رُوا شَبابي زَمان غادر الولدان شِيبا\nوَما خَفيت عَلَيَّ الناس حَتّى أَروم اليَوم مِن رَخم حَليبا\nأَذا ظَنَ الذُباب خَشيتُ مِنهُ لِفَقد مُساعِدي يُلفى مُجيبا\nوَهب أَني حَكيت الشاة ضُعفاً فَما لي أَحسَب السُنور ذِيبا\nعَسى يَوماً يَراش جَناح حَظي فَأَغدو قاصِداً شَهماً وَهوبا\nعَزيزاً مُستَفاداً مِن عَزيز كَوَرد أَكسب الأَيام طيبا\nلَئِن سَعدت وَلَو في النَوم عَيني بِرُؤياهُ لِتلكَ العَين طُوبى\nوَإِن ضَنَ السَحاب فَلا أُبالي وَفَيض نَداهُ قَد أَضحى سَكوبا\nوَهَل أَبغي وَفي النادي سَناهُ طُلوع الشَمس أَو أَخشى المَغيبا\nظَفرت بِمَدحِهِ فَعَلَوت قَدراً وَسَماني الزَمان بِهِ أَديبا\nوَغادر رَوض أَفكاري جَنيّاً وَصَبر غُصن آمالي رَطيبا\nإِذا تُلِيَت مَآثرهُ بِأَرض غَدا الفلك المُدار بِها طَروبا"
    }
]